from typing import List

spb_metro = {
    "Красная": [
        "Девяткино", "Гражданский проспект", "Академическая",
        "Политехническая", "Площадь Мужества", "Лесная", "Выборгская",
        "Площадь Ленина", "Чернышевская", "Площадь Восстания", "Владимирская",
        "Пушкинская", "Технологический институт", "Балтийская", "Нарвская",
        "Кировский завод", "Автово", "Ленинский проспект", "Проспект Ветеранов"
    ],

    "Синяя": [
        "Парнас", "Проспект Просвещения", "Озерки", "Удельная", "Пионерская",
        "Чёрная речка", "Петроградская", "Горьковская", "Невский проспект",
        "Сенная площадь", "Технологический институт", "Фрунзенская",
        "Московские ворота", "Электросила", "Парк Победы", "Московская",
        "Звёздная", "Купчино"
    ],

    "Зелёная": [
        "Приморская", "Василеостровская", "Гостиный двор", "Маяковская",
        "Площадь Александра Невского", "Елизаровская", "Ломоносовская",
        "Пролетарская", "Обухово", "Рыбацкое"
    ],

    "Оранжевая": [
        "Спасская", "Достоевская", "Лиговский проспект",
        "Площадь Александра Невского", "Новочеркасская",
        "Ладожская", "Проспект Большевиков", "Улица Дыбенко"
    ],

    "Фиолетовая": [
        "Комендантский проспект", "Старая Деревня", "Крестовский остров",
        "Чкаловская", "Спортивная", "Адмиралтейская", "Садовая",
        "Звенигородская", "Обводный канал", "Волковская", "Бухарестская",
        "Международная", "Проспект Славы", "Дунайская", "Шушары"
    ]
}

emodji = {
    "Красная": "🔴",
    "Синяя": "🔵",
    "Зелёная": "🟢",
    "Оранжевая": "🟠",
    "Фиолетовая": "🟣"
}


def get_station_emoji(station_name: str) -> str:
    """
    Возвращает эмодзи цвета ветки по названию станции.
    """
    for line_color, stations in spb_metro.items():
        if station_name in stations:
            return emodji.get(line_color, '⚪️')

    return '🚃'


async def prettify_info(data: List[dict]):
    """
        Форматирует данные из БД для сообщения пользователю. 
    """
    answer = ''
    for d in data:
        #maps_url = 'https://yandex.ru/maps/-/CHgsnI~0'
        color = get_station_emoji(d['pharm_subway'])
        #last_update_str = d['last_update'].strftime('%d.%m.%Y %H:%M')
        result = '''\n<b>{name}</b>, {loc}
Региональная льгота — {reg} шт.
<i>Данные от {time}</i>

<blockquote>Район {distr},{c}{sub}</blockquote>
        '''.format(
            name=d['pharm_name'], loc=d['pharm_loc'],
            reg=d['regional'], time=d['last_update'],
            distr=d['pharm_district'], c=color, sub=d['pharm_subway']
                )
        answer += result

    return answer
