from typing import List
from datetime import datetime as dt

spb_metro = {
    "Красная": [
        "Девяткино", "Гражданский проспект", "Академическая",
        "Политехническая", "Площадь Мужества", "Лесная", "Выборгская",
        "Площадь Ленина", "Чернышевская", "Площадь Восстания", "Владимирская",
        "Пушкинская", "Технологический институт", "Балтийская", "Нарвская",
        "Кировский завод", "Автово", "Ленинский проспект", "Проспект Ветеранов"
    ],

    "Синяя": [
        "Парнас", "Проспект Просвещения", "Озерки", "Удельная", "Пионерская",
        "Чёрная речка", "Петроградская", "Горьковская", "Невский проспект",
        "Сенная площадь", "Технологический институт", "Фрунзенская",
        "Московские ворота", "Электросила", "Парк Победы", "Московская",
        "Звёздная", "Купчино"
    ],

    "Зелёная": [
        "Приморская", "Василеостровская", "Гостиный двор", "Маяковская",
        "Площадь Александра Невского", "Елизаровская", "Ломоносовская",
        "Пролетарская", "Обухово", "Рыбацкое"
    ],

    "Оранжевая": [
        "Спасская", "Достоевская", "Лиговский проспект",
        "Площадь Александра Невского", "Новочеркасская",
        "Ладожская", "Проспект Большевиков", "Улица Дыбенко"
    ],

    "Фиолетовая": [
        "Комендантский проспект", "Старая Деревня", "Крестовский остров",
        "Чкаловская", "Спортивная", "Адмиралтейская", "Садовая",
        "Звенигородская", "Обводный канал", "Волковская", "Бухарестская",
        "Международная", "Проспект Славы", "Дунайская", "Шушары"
    ]
}

emodji = {
    "Красная": "🔴",
    "Синяя": "🔵",
    "Зелёная": "🟢",
    "Оранжевая": "🟠",
    "Фиолетовая": "🟣"
}


def get_station_emoji(station_name: str) -> str:
    """
    Возвращает эмодзи цвета ветки по названию станции.
    """
    for line_color, stations in spb_metro.items():
        if station_name in stations:
            return emodji.get(line_color, '⚪️')

    return '🚃'


def format_update_time(last_update) -> str:
    """Форматирует время обновления для отображения"""
    months = [
        '', 'января', 'февраля', 'марта', 'апреля', 'мая', 'июня',
        'июля', 'августа', 'сентября', 'октября', 'ноября', 'декабря'
    ]

    time = dt.strptime(str(last_update).split('.')[0], '%Y-%m-%d %H:%M:%S')

    return '{} {} {} {:02d}:{:02d}'.format(
        time.day, months[time.month], time.year, time.hour, time.minute
    )


def get_maps_url(address: str) -> str:
    main_url = 'https://maps.yandex.ru/maps/?text='
    return main_url + address


async def prettify_info(data: List[dict]):
    """
        Форматирует данные из БД для сообщения пользователю.
    """
    answer = ''
    for d in data:
        maps_url = get_maps_url(d['pharm_loc'])
        color = get_station_emoji(d['pharm_subway'])
        time = format_update_time(d['last_update'])
        phone = '+7812' + d['pharm_phone']
        result = (
            f'\n<b>{d['pharm_name']}</b>, '
            f'<a href="{maps_url}">📍{d['pharm_loc']}</a>\n'
            f'Региональная льгота — {d['regional']} шт.\n'
            f'<i>Данные от {time}</i>\n'
            f'☎️ {phone}'
            f'<blockquote>{d['pharm_district']} район, '
            f'{color} {d['pharm_subway']}\n'
            f'Расписание работы льготного отдела:\n'
            f'{d['pharm_work']}'
            f'</blockquote>\n'
        )
        answer += result

    return answer
